docs/content/Deprecated/i3.md
+++
title = "i3 + Polybar"
author = ["Michael Reitmeir"]
draft = false
weight = 3
+++

## i3 {#i3}

Like for most people in 2018, [i3](https://i3wm.org/) was my first tiling window manager. More precisely actually, I used a hacky combination of i3 and the [Cinnamon](https://en.wikipedia.org/wiki/Cinnamon_(desktop_environment)) desktop environment at first. This was made by [Eric Dubois](https://github.com/erikdubois), who is nowadays known as the [ArcoLinux](https://arcolinux.com/) guy. I don't think it exists anymore.

For my i3 config, I actually just had two different config files for my desktop PC ("One") and my convertible laptop ("IdeaPad").


### i3 on One {#i3-on-one}

```python
{{% include file="symlink/i3One" %}}
```


### i3 on IdeaPad {#i3-on-ideapad}

```python
{{% include file="symlink/i3IdeaPad" %}}
```


## Polybar {#polybar}

At some later point, I used [Polybar](https://github.com/polybar/polybar) instead of the default i3 bar. It's just sexier.

Again, this has two different configs for my desktop and my laptop, respectively. They also both have their own start scripts.


### Polybar on One {#polybar-on-one}


#### config {#config}

```ini
{{% include file="symlink/polybarOne" %}}
```


#### launch.sh {#launch-dot-sh}

```bash
{{% include file="symlink/polybarLaunchOne" %}}
```


### Polybar on IdeaPad {#polybar-on-ideapad}


#### config {#config}

```ini
{{% include file="symlink/polybarIdeaPad" %}}
```


#### launch.sh {#launch-dot-sh}

This one actually has some fancy features like screen rotation... Let's see if I'll ever implement those properly again. ^^

```bash
{{% include file="symlink/polybarLaunchIdeaPad" %}}
```
